{"id":1,"rankingNo":"1st","genre":"Battle Royale","gameName":"Fortnite Battle Royale","ageRating":"12+","gamePrice": "0.00","gameStationReview":"Fortnite Battle Royale is the perfect mixture of a sandbox-like builder crossed with a high intensity battle royale shooter. The game's randomisation of loot locations and varied storm circles means that no matter how many times you play this game, it will always tell a different story to the game before. With the game being free-to-play excluding in-game cosmetic purchases, this game accomodates for all regardless of budget. The story mode save to world is also a great game mode along with the flagship battle royale online mode, however this does come at a cost, as it is not included with the free-to-play download.","gameScore":"10/10","gameBuy1":"https://store.playstation.com/en-gb/product/EP1464-PPSA01923_00-FORTNITETESTING2","gameBuy2":"","gameBuy3":"","gameVideo1": "https://www.youtube.com/embed/vlL_U07Qol4?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/arrE1GUmOyw","gameVideo3":"https://www.youtube.com/embed/ZPhQX36qij0","gameSummary":"Fortnite Battle Royale is a game of survival, which means in order to win, you must defeat the other 99 online games in the game. This competitive element adds a touch of urgency to the game, gamers also need to avoid being caught in the eye of the storm to remain in the game, there are regular countdowns to when the storm is approaching. 100 games fight against each other in game versus game combat to be the  last one standing. It is a fast-paced, action-packed game, not unlike The Hunger Games, where strategic  thinking is a must in order to survive. There are an estimated 125 million games on Fortnite. Games skydive onto a small island, are equipped with an axe and must scavenge for more weapons, while  simultaneously avoiding a killer electrical storm. As games are eliminated, the field of play also   gets smaller, meaning games are put closer together. Updates regularly flash on screen detailing how   another game was eliminated “X eliminated Y with a grenade”, adding to the sense of urgency.   While the game is free to play, you do need to create an account with Epic Games."}
{"id":2,"rankingNo":"2nd","genre":"Racing Simulator","gameName":"F1 2021","ageRating":"E","gamePrice": "59.99","gameStationReview":"F1 2021 brings a hyper-realistic simulator racing game right to your fingertips. The highly advanced artificial intelligence allows for users to have incredibly competitive singlegame races on whichever difficulty is right for them. The graphics displaying the different weather types and the degradation of tyres looks nothing short of reality, at a glance, you could mistake some of the scenes found in game for the real races themselves. This years F1 game introduces the brilliant singlegame campaign of Braking Point, a game mode where users take on the role as a young aspiring rookies racing driver who is trying to prove himself to the grid that he is worthy of his place in Formula 1.","gameScore":"9/10","gameBuy1":"https://www.playstation.com/en-gb/games/f1-2021/?emcid=pa-co-422388&gclsrc=aw.ds&gclid=CjwKCAjw9LSSBhBsEiwAKtf0n6ONmneprG0sjDVDc9m0LZeGdPGV4nPHqyFtQCFGAHBIblNCw4wT4xoCOYoQAvD_BwE","gameBuy2":"https://www.game.co.uk/en/f1-2021-2855327","gameBuy3":"https://www.amazon.co.uk/Electronic-Arts-1104841-2021-PS5/dp/B092JQXQ5L","gameVideo1": "https://www.youtube.com/embed/A2rGHE93Rds?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/-ZzrlVQq7-s","gameVideo3":"https://www.youtube.com/embed/ef8kNyXUIzU","gameSummary":"Every story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-game Career, and get even closer to the grid with ‘Real-Season Start’. Take your team to the top in the acclaimed ten-year ‘My Team’ Career mode, or race head-to-head in split-screen and multigame. Immerse yourself in the greatest racing spectacle on the planet and race with the authentic lineup of twenty heroic drivers and ten iconic teams from the 2021 season!"}
{"id":3,"rankingNo":"3rd","genre":"Action-Adventure","gameName":"Uncharted: Legacy of Thieves","ageRating":"16","gamePrice": "44.99","gameStationReview":"Uncharted: Legacy of Thieves brings all the Nathan Drake expeditions all in one. With the inclusion of both Uncharted: The Lost Legacy and Uncharted 4: A Thief's End, the users always have unsurveyed maps to explore. This visually stunning masterpiece showcases the gritty adventures of the charismatic adventurer, Nathan Drake, as he continues his hunt for history across all spans of the globe, whether it be in secluded forestry in Madagascar, or barren deserts in the Western Sahara. Now remastered specially for the PS5, this game is the perfect purchase to achieve the most of the new consoles features, with highly accurate haptic feedback with the remote, there has never been a video game that has felt as immersive as this one.","gameScore":"10/10","gameBuy1":"https://www.playstation.com/en-gb/games/uncharted-legacy-of-thieves-collection/?emcid=pa-co-422388&gclsrc=aw.ds&gclid=CjwKCAjw9LSSBhBsEiwAKtf0nw7_-SEY-uHkat3X9tQPY72_hwVkjQtcwxy9uL8kPIlHPHoO9j0SiRoCdzwQAvD_BwE","gameBuy2":"https://www.game.co.uk/en/uncharted-legacy-of-thieves-collection-2858128","gameBuy3":"https://www.amazon.co.uk/UNCHARTED-Legacy-Thieves-Collection-PS5/dp/B09N7TWLWK/ref=asc_df_B09N7TWLWK/?tag=googshopuk-21&linkCode=df0&hvadid=534913857270&hvpos=&hvnetw=g&hvrand=757633712140636403&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=9046552&hvtargid=pla-1610813012315&psc=1","gameVideo1": "https://www.youtube.com/embed/eL57K6LLUfA?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/y9wRaZCo_1I","gameVideo3":"https://www.youtube.com/embed/RSc4SYCBRM8","gameSummary":"Discover lost history with the charismatic yet complex thieves, Nathan Drake and Chloe Frazer, as they travel the world with a sense of wonder, pursuing extraordinary adventures and lost lore – remastered in stunning detail for the PS5™ console with improved visuals and frame rate. Several years after his last adventure, retired fortune hunter Nathan Drake, is forced back into the world of thieves. Fate comes calling when Sam, Drake’s presumed dead brother, resurfaces seeking his help to save his own life and offering an adventure Drake can’t resist. Drake's greatest adventure will test his physical limits, his resolve, and ultimately what he’s willing to sacrifice to save the ones he loves. On the hunt for Captain Henry Avery’s long-lost treasure, Sam and Drake set off to find Libertalia, the pirate utopia deep in the forests of Madagascar – leading to a journey around the globe through jungle isles, far-flung cities, and snow capped peaks on the search for Avery’s fortune."}
{"id":4,"rankingNo":"4th","genre":"Action-RPG","gameName":"Horizon Forbidden West","ageRating":"16","gamePrice": "69.99","gameStationReview":"Horizon Forbidden West is truly fantastic, right from the start of the story, all the way to the end, the graphics and the virtual mythology create a truly unique masterpiece. The design of the game perfectly encaptures the true potential and power of the PlayStation 5, with haptic feedback and incredible three-dimensional audio throughout the storyline, the game feels as immersive as ever. The story is well written and all-in-all a great game to expand your PS5 gaming portfolio. ","gameScore":"9/10","gameBuy1":"https://www.playstation.com/en-gb/games/horizon-forbidden-west/?emcid=pa-co-422388&gclsrc=aw.ds&gclid=CjwKCAjw9LSSBhBsEiwAKtf0nzFadSy_hAz5ZxbyOjL0vKrj8vQpU31zcZK6QNnAVEPezw9muSL_DBoC9wsQAvD_BwE","gameBuy2":"https://www.game.co.uk/en/horizon-forbidden-west-2858110","gameBuy3":"https://www.amazon.co.uk/PlayStation-9720690-Horizon-Forbidden-West/dp/B09FBCRKC9/ref=sr_1_1?crid=25HPF0IRHO3O7&keywords=horizon+forbidden+west+ps5&qid=1649432730&s=videogames&sprefix=horizo%2Cvideogames%2C129&sr=1-1","gameVideo1": "https://www.youtube.com/embed/veLQ2cdyBBo?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/Jbsmr-Afzn0","gameVideo3":"https://www.youtube.com/embed/n3TH_Yo7vb4","gameSummary":"Join Aloy as she braves the Forbidden West – a majestic but dangerous frontier that conceals mysterious new threats.\nExplore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon.\nThe land is dying. Vicious storms and an unstoppable blight ravage the scattered remnants of humanity, while fearsome new machines prowl their borders. Life on Earth is hurtling towards another extinction, and no one knows why.\nIt's up to Aloy to uncover the secrets behind these threats and restore order and balance to the world. Along the way, she must reunite with old friends, forge alliances with warring new factions and unravel the legacy of the ancient past – all the while trying to stay one step ahead of a seemingly undefeatable new enemy. Brave an expansive open world – discover distant lands, new enemies, rich cultures and striking characters.\nA majestic frontier – explore the lush forests, sunken cities and towering mountains of a far-future America.\nConfront new dangers – engage in strategic battles against enormous machines and mounted human enemies by using weapons, gear and traps crafted from salvaged parts.\nUnravel startling mysteries – uncover the secret behind Earth’s imminent collapse and unlock a hidden chapter in the ancient past... one that will change Aloy forever."}
{"id":5,"rankingNo":"5th","genre":"Sport","gameName":"FIFA 22","ageRating":"3","gamePrice": "69.99","gameStationReview":"EA Sports' FIFA 22 is a huge step in the right direction over its predecessors. The inclusion of new hypermotion technology on the new gaming engine designed specifically for PS5 brings the pitch to live. The gameplay feels fluid and the reactions and movements from the games on the pitch look and feel as realistic as though you were watching a football match on the TV. While there have been a lack of changes in the game modes such as FIFA ULTIMATE TEAM or CAREER MODE, the overall optimisations and improvents on gameplay make for a great purchase for your PS5 console to widen your variety of games.","gameScore":"7/10","gameBuy1":"https://store.playstation.com/en-gb/concept/10002538","gameBuy2":"https://www.game.co.uk/en/fifa-22-2864117","gameBuy3":"https://www.amazon.co.uk/Electronic-Arts-1082428-FIFA-PS5/dp/B0976G3MQ3/ref=sr_1_1?crid=1XQFSH19VV240&keywords=fifa+22+ps5&qid=1649432778&s=videogames&sprefix=fifa+22+ps5%2Cvideogames%2C88&sr=1-1","gameVideo1": "https://www.youtube.com/embed/_8V3KJpUbrI?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/dtRMcWaBf7U","gameVideo3":"https://www.youtube.com/embed/u1pVqQ_iZUU","gameSummary":"Brand new for EA SPORTS FIFA and on next generation consoles, HyperMotion combines two technologies for the first time ever, revolutionising football gameplay. Live out your football dreams in FIFA 22 Career Mode as you create a club and lead them from relegation candidates to global giants, and enjoy an overhauled Game Career experience that gives you more ways to progress, achieve, and immerse yourself in your Pro’s journey through the game. Reimagined gameplay creates fundamental advances that you’ll feel across every mode in FIFA 22. A goalkeeper rewrite brings more composure and consistency to the most important position on the pitch, new ball physics reimagine every pass, shot, and goal, and explosive sprint lets you feel the acceleration of the game’s quickest games."}
{"id":6,"rankingNo":"6th","genre":"Action-Adventure","gameName":"Ratchet and Clank Rift Apart","ageRating":"7","gamePrice": "52.49","gameStationReview":"Ratchet and Clank Rift Apart is a technical showcase of the true power of the PlayStation 5 consoles, in our eyes, this game alone is one of the many reasons to buy the PS5 console. This intergalactic adventure game lives up to the hype and nostalgia of the previous Ratchet and Clank games that Sony have delivered upon time and time again. The gripping story line, brilliant character designs and inventive gameplay creates an absolute masterpiece available for you to play on the PS5.","gameScore":"9/10","gameBuy1":"https://store.playstation.com/en-gb/product/EP9000-PPSA01474_00-RATCHETCLANKRIFT","gameBuy2":"https://www.game.co.uk/en/ratchet-clank-rift-apart-2850656","gameBuy3":"https://www.amazon.co.uk/Ratchet-Clank-Rift-Apart-PS5/dp/B08W63D82J/ref=sr_1_1?crid=3R0B58DYI0MDO&keywords=ratchet+and+clank+rift+apart+ps5&qid=1649432866&s=videogames&sprefix=ratchet+and+clank+rift+apart+ps5%2Cvideogames%2C83&sr=1-1","gameVideo1": "https://www.youtube.com/embed/IJNapbBHoFY?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/BmRADhJKZIg","gameVideo3":"https://www.youtube.com/embed/R3cVCikK5Es","gameSummary":"The intergalactic adventurers are back with a bang in Ratchet & Clank: Rift Apart. Help them stop a robotic emperor intent on conquering cross-dimensional worlds, with their own universe next in the firing line.\n\nBuilt from the ground up by acclaimed studio Insomniac Games, go above and beyond with the mind-blowing speed and immersive features of the PS5™ console. Brand-new haptic feedback and adaptive trigger technology creates astonishing physical sensations, bringing in-game actions to life in your hands via the DualSense™ wireless controller.\n\nEnjoy a visually dazzling, interdimensional adventure, complete with familiar faces and some new allies – only on the PlayStation®5 console."}
{"id":7,"rankingNo":"7th","genre":"Sport","gameName":"NBA 2K22","ageRating":"3","gamePrice": "64.99","gameStationReview":"With the true power of the PS5 console, NBA 2K22 feels more immersive and realistic than ever. The gameplay is slower and more lifelike to the sport itself this year in NBA 2K22. The roleplay storyline of MyCareer is less favourable than previous years but the overall improvent on content in other gamemodes this year is extremely rich, making NBA 2K22 a massive improvement on the previous basketball games, all-in-all, this game is a must-buy for any basketball enthusiasts that want to immersively shoot hoops on their PlayStation 5!","gameScore":"8/10","gameBuy1":"https://www.playstation.com/en-gb/games/nba-2k22/?emcid=pa-co-422388&gclsrc=aw.ds&gclid=CjwKCAjw9LSSBhBsEiwAKtf0n9VO5wdbZCFNDI2CmS5ib8nm7OGlBEyhkh2Tcoyd-yoDuUzrSCf6GRoCPT4QAvD_BwE","gameBuy2":"https://www.game.co.uk/en/nba-2k22-with-game-exclusive-2864162","gameBuy3":"https://www.amazon.co.uk/NBA-2K22-Amazon-Exclusive-DLC/dp/B099FY5V6L/ref=sr_1_1?crid=1M72F86LXUMPH&keywords=nba+2k22+ps5&qid=1649432920&s=videogames&sprefix=nba+2k22+ps5%2Cvideogames%2C97&sr=1-1","gameVideo1": "https://www.youtube.com/embed/iItp-X700u4?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/7pIy_g0-R9Y","gameVideo3":"https://www.youtube.com/embed/eI3aM9oztXA","gameSummary":"NBA 2K22 puts the entire basketball universe in your hands. PLAY NOW in real NBA and WNBA environments against authentic teams and games. Build your own dream team in MyTEAM with today’s stars and yesterday’s legends. Live out your own pro journey in MyCAREER and experience your personal rise to the NBA. Flex your management skills as a powerful Executive in MyNBA and MyWNBA. Anyone, anywhere can hoop in NBA 2K22. Play as your favorite NBA and WNBA teams and stars, and experience the authenticity of professional basketball at the highest levels. With best-in-class visual presentation and game AI, up-to-date rosters and historic teams, and much more, the game has never felt more real and complete than it does in NBA 2K. Feel the energy of the crowd, the intensity of the competition, and the endless entertainment of one of the most immersive sports product in gaming today."}
{"id":8,"rankingNo":"8th","genre":"Sport","gameName":"Madden NFL 22","ageRating":"3","gamePrice": "69.99","gameStationReview":"Unfortunately, the gameplay of Madden NFL 22, even on the newly adapted PS5 game engine, is still far from perfect. Madden NFL 22 is a massive step in the right direction from the NFL 21 predecessor, the gameplay is smoother, more realistic and slightly more immersive than previous games. However, saying that, the game is still far inferior to similar style games in other sporting categories. Compared to other EA flagship games such as FIFA 22, the feel of the game is less lifelike and will more than likely leave you feeling a little underwhelmed.","gameScore":"6/10","gameBuy1":"https://store.playstation.com/en-gb/product/EP0006-PPSA02344_00-MADDENNFL22GAME1","gameBuy2":"https://www.game.co.uk/en/madden-nfl-22-2862460","gameBuy3":"https://www.amazon.co.uk/Electronic-Arts-1082965-Madden-PS5/dp/B0976GS8MB/ref=sr_1_16?crid=1HQ6S8VL2KJG2&keywords=madden+nfl+22&qid=1649433141&s=videogames&sprefix=madden+nfl+22%2Cvideogames%2C90&sr=1-16","gameVideo1": "https://www.youtube.com/embed/PLb1wFyBCWQ?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/wOYYTn_Iy7w","gameVideo3":"https://www.youtube.com/embed/nBBLR3KVCbE","gameSummary":"Madden NFL 22 is where gameday happens. It’s everything you love about the NFL injected into every mode via ALL-NEW Dynamic Gameday. Brought to life by Next Gen Stats Star-Driven AI and Gameday Atmosphere elements, Dynamic Gameday delivers the smartest gameplay experience ever, all powered by real life data."}
{"id":9,"rankingNo":"9th","genre":"Survival-Adventure","gameName":"Subnautica: Below Zero","ageRating":"12","gamePrice": "29.99","gameStationReview":"Subnautica: Below Zero refines the survival simulator compared to previous Subnautica games, this edition is definitely an upgrade on the prior games, setting a new highpoint for the genre. The amazing world building and the vast amount of ocean to explore makes this game a great gaming excursion to indulge with your PlayStation 5. The mixture of risk vs reward and adaptability throughout the premise of the game leaves the user with a very tasking campaign, making it a perfect game for any gamers that like more strategic styles of games.","gameScore":"7/10","gameBuy1":"https://store.playstation.com/en-gb/product/EP5426-PPSA02457_00-BELOWZERSUB79247","gameBuy2":"https://www.game.co.uk/en/subnautica-below-zero-2850535","gameBuy3":"https://www.amazon.co.uk/Unknown-195908-Subnautica-Below-Zero/dp/B08YZRVR8B/ref=sr_1_5?crid=1HZAEUW553VVQ&keywords=subnautica+below+zero&qid=1649433184&s=videogames&sprefix=subnautica+below+zero%2Cvideogames%2C80&sr=1-5","gameVideo1": "https://www.youtube.com/embed/wqEb4pGMQbY?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/WHECVAOt8YQ","gameVideo3":"https://www.youtube.com/embed/dgpT9c2EhAw","gameSummary":"From the award-winning studio, Unknown Worlds Entertainment, presents the return to the world of 4546B with Subnautica Below Zero. Dive into a freezing underwater adventure on an alien planet.\n \nSet one year after the original Subnautica, Below Zero challenges you to survive the icy biomes both above and below the surface. Craft tools, scavenge for supplies, and unravel the next chapter in the Subnautica story. Survival Is Key: Gather valuable materials, craft tools, manage your hunger and thirst, all while evading the dangerous wildlife that sees you as its next meal\nThe Mysteries Submerged on Planet 4546B: You came here in search of answers. You risked everything to get here and you will not leave until you have uncovered the truth…\nExploration: Delve into unique aquatic and terrain biomes that will unlock not only materials, but the answers that you seek\nBuild Your Habitat: Crafting and building the comforts of home here.  These bases will be integral for your survival from not only the wildlife, but also the harsh environment around you"}
{"id":10,"rankingNo":"10th","genre":"Simulation","gameName":"Farming Simulator 22","ageRating":"3","gamePrice": "44.99","gameStationReview":"In our eyes, Farming Simulator 22 is the best edition yet in the long-running gaming series. The robust strategic and micro-management involved with the game is perfectly augmented into the new generation of PlayStation consoles, allowing users for a fully immersive simulation experience.","gameScore":"8/10","gameBuy1":"https://store.playstation.com/en-gb/concept/10001771","gameBuy2":"https://www.game.co.uk/en/farming-simulator-22-2855607","gameBuy3":"https://www.amazon.co.uk/Farming-Simulator-22-PS5/dp/B09GYFJKT2/ref=sr_1_3?crid=2A8G9CUSKTSW0&keywords=farming+simulator+22&qid=1649433245&s=videogames&sprefix=farming+simulator+22%2Cvideogames%2C92&sr=1-3","gameVideo1": "https://www.youtube.com/embed/laIXYT9cdCQ?autoplay=1&mute=1","gameVideo2":"https://www.youtube.com/embed/4IDcfJGTltI","gameVideo3":"https://www.youtube.com/embed/yHXoxi92mVg","gameSummary":"LET THE GOOD TIMES GROW!\n\nCultivated to be bigger and better – the ultimate and multimillion-selling farming simulation returns this November! Farming Simulator 22 offers more depth and the highest extent of game freedom in the history of the series. With more than 400 machines and tools from over 100 authentic agricultural brands, games can look forward to an improved and realistic-as-ever simulation. Suited for all ages, games dive into even more diverse agriculture, animal husbandry and forestry. Key Features:\n400+ machines, new categories, 100+ agricultural brands.\nFamily-friendly, relaxed multigame mode for 1-16 games.\nNew crops & machinery: grapes, olives and sorghum.\nSeasonal cycles add new gameplay mechanics.\nProduction chains add new economic layer.\nTwo brand-new maps + updated alpine map.\nVastly improved customization.\nPerformance boost on all systems.\nLatest technology: DirectX 12, TAA, fidelityFX FSR etc.\nMulti-year content strategy – the ultimate farming long-seller!"}